src/Catalogs/цур_ИнформационныеБазы/цур_ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>цур_ИнформационныеБазы</name>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>СервернаяБаза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляСборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузкиКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникМетаданных</name>
    <type>
      <types>EnumRef.цур_ИсточникиМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникРолей</name>
    <type>
      <types>EnumRef.цур_РежимыЗагрузкиРолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКПлатформе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПромежуточнуюБазу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/цур_КонструкторРасширенияСервер/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру параметров сборки CFE с заполненными значениями по умолчанию.
//
// Возвращаемое значение:
//  Структура - параметры сборки:
//   * ИмяРасширения    - Строка - имя расширения в конфигурации
//   * ВерсияРасширения - Строка - версия расширения в формате N.N.N.N
//   * ПутьКПлатформе   - Строка - путь к 1cv8.exe; пустая строка - автоопределение
//   * НомерВерсии      - Строка - номер последней части версии (по умолчанию "1")
//
Функция НовыеПараметрыСборки() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИмяРасширения",    "пр_цур_ПользовательскиеРолиРасширение");
	Результат.Вставить("ВерсияРасширения", "1.0.0.1");
	Результат.Вставить("ПутьКПлатформе",   "");
	Результат.Вставить("НомерВерсии",      "1");

	Возврат Результат;

КонецФункции

// Собирает CFE-файл расширения из XML-исходников через конфигуратор 1С.
// КаталогРасширения должен содержать распакованную пустую базу данных (1Cv8.1CD)
// и подкаталог ExtensionConfiguration/ с XML-файлами расширения.
//
// Параметры:
//  КаталогРасширения - Строка - путь к каталогу с пустой БД и подкаталогом ExtensionConfiguration/
//  ПараметрыСборки   - Структура - см. НовыеПараметрыСборки()
//
// Возвращаемое значение:
//  Структура - результат сборки:
//   * Успешно    - Булево
//   * ПутьКCFE  - Строка - путь к собранному файлу CFE при успехе
//   * ТекстОшибки - Строка
//   * Лог        - Строка - вывод конфигуратора
//
Функция СобратьCFE(КаталогРасширения, ПараметрыСборки) Экспорт

	Результат = НовыйРезультатОперации();

	ПутьИсполняемогоФайла = ПараметрыСборки.ПутьКПлатформе;
	Если ПустаяСтрока(ПутьИсполняемогоФайла) Тогда
		ПутьИсполняемогоФайла = ПутьКПлатформе();
		Если ПустаяСтрока(ПутьИсполняемогоФайла) Тогда
			Результат.ТекстОшибки = "Не удалось определить путь к платформе 1С.";
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	РазделительПути  = ПолучитьРазделительПутиСервера();

	// Формируем параметры подключения к базе сборки
	ПараметрыПодключения = ПолучитьПараметрыПодключения(КаталогРасширения, РазделительПути);

	КаталогИсходников = КаталогРасширения + РазделительПути + "ExtensionConfiguration";

	// Расположение лога и CFE зависит от типа базы
	Если ПараметрыПодключения.СервернаяБаза Тогда
		// Для серверной базы файлы сборки размещаем в каталоге расширения
		ФайлЛога = КаталогРасширения + РазделительПути + "Report.txt";
		ПутьCFE  = КаталогРасширения + РазделительПути + ПараметрыСборки.ИмяРасширения + ".cfe";
	Иначе
		// Для файловой базы файлы сборки размещаем рядом с базой
		ФайлЛога = ПараметрыПодключения.ПутьКБазе + РазделительПути + "Report.txt";
		ПутьCFE  = ПараметрыПодключения.ПутьКБазе + РазделительПути + ПараметрыСборки.ИмяРасширения + ".cfe";
	КонецЕсли;

	// Шаг 1: LoadConfigFromFiles + UpdateDBCfg - загружаем XML-исходники в базу
	КомандаЗагрузки = СформироватьКомандуЗагрузки(
		ПутьИсполняемогоФайла,
		ПараметрыПодключения,
		КаталогИсходников,
		ПараметрыСборки.ИмяРасширения,
		ФайлЛога);

	КодВозврата = Неопределено;
	//BSLLS:ExternalAppStarting-off
	ЗапуститьПриложение(КомандаЗагрузки, , Истина, КодВозврата);
	//BSLLS:ExternalAppStarting-on

	Результат.Лог = "" + ПрочитатьФайлЛога(ФайлЛога);

	Если КодВозврата = Неопределено Или КодВозврата <> 0 Тогда
		Результат.ТекстОшибки = СтрШаблон(
			"Ошибка загрузки исходников в базу (код %1).%2%3",
			КодВозврата,
			Символы.ПС,
			Результат.Лог);
		Возврат Результат;
	КонецЕсли;

	// Шаг 2: DumpCfg - выгружаем CFE из базы
	КомандаВыгрузки = СформироватьКомандуВыгрузки(
		ПутьИсполняемогоФайла,
		ПараметрыПодключения,
		ПутьCFE,
		ПараметрыСборки.ИмяРасширения,
		ФайлЛога);

	КодВозвратаВыгрузки = Неопределено;
	//BSLLS:ExternalAppStarting-off
	ЗапуститьПриложение(КомандаВыгрузки, , Истина, КодВозвратаВыгрузки);
	//BSLLS:ExternalAppStarting-on

	Результат.Лог = "" + Результат.Лог + Символы.ПС + ПрочитатьФайлЛога(ФайлЛога);

	Если КодВозвратаВыгрузки = Неопределено Или КодВозвратаВыгрузки <> 0 Тогда
		Результат.ТекстОшибки = СтрШаблон(
			"Ошибка выгрузки CFE из базы (код %1).%2%3",
			КодВозвратаВыгрузки,
			Символы.ПС,
			Результат.Лог);
		Возврат Результат;
	КонецЕсли;

	Результат.Успешно  = Истина;
	Результат.ПутьКCFE = ПутьCFE;

	// Обновляем счётчик версии в справочнике базы сборки
	ЗаписатьСледующийНомерВерсии();

	Возврат Результат;

КонецФункции

// Устанавливает (или обновляет) расширение из файла CFE программным способом.
//
// Параметры:
//  ПутьCFE       - Строка - путь к файлу CFE
//  ИмяРасширения - Строка - имя расширения для поиска/создания; если пустая строка - создаётся новое
//
// Возвращаемое значение:
//  Структура - результат операции:
//   * Успешно     - Булево
//   * ТекстОшибки - Строка
//
Функция УстановитьРасширение(ПутьCFE, ИмяРасширения = "") Экспорт

	Если НЕ ЕстьПравоУстановкиРасширений() Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав для установки расширения.'");
	КонецЕсли;

	Результат = НовыйРезультатОперации();

	ПроверкаФайла = Новый Файл(ПутьCFE);
	Если НЕ ПроверкаФайла.Существует() Тогда
		Результат.ТекстОшибки = СтрШаблон("Файл CFE не найден: %1", ПутьCFE);
		Возврат Результат;
	КонецЕсли;

	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьCFE);

	Расширения = РасширенияКонфигурации.Получить();

	НайденноеРасширение = Неопределено;

	Если НЕ ПустаяСтрока(ИмяРасширения) Тогда

		Для Каждого Расш Из Расширения Цикл

			Если Расш.Имя = ИмяРасширения Тогда
				НайденноеРасширение = Расш;
				Прервать;
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Если НайденноеРасширение = Неопределено Тогда
		НайденноеРасширение = РасширенияКонфигурации.Создать();
	КонецЕсли;

	НайденноеРасширение.Активно         = Истина;
	НайденноеРасширение.БезопасныйРежим = Ложь;

	ЗащитаРасширения = Новый ОписаниеЗащитыОтОпасныхДействий;
	ЗащитаРасширения.ПредупреждатьОбОпасныхДействиях = Ложь;
	НайденноеРасширение.ЗащитаОтОпасныхДействий = ЗащитаРасширения;

	НайденноеРасширение.Записать(ДвоичныеДанные);

	Результат.Успешно = Истина;

	Возврат Результат;

КонецФункции

// Удаляет расширение с указанным именем из конфигурации.
//
// Параметры:
//  ИмяРасширения - Строка - имя расширения для удаления
//
// Возвращаемое значение:
//  Булево - Истина если расширение найдено и удалено, Ложь если расширение не найдено
//
Функция УдалитьРасширение(ИмяРасширения) Экспорт

	Расширения = РасширенияКонфигурации.Получить();

	Для Каждого Расш Из Расширения Цикл

		Если Расш.Имя = ИмяРасширения Тогда
			Расш.Удалить();
			Возврат Истина;
		КонецЕсли;

	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Возвращает путь к исполняемому файлу платформы 1С.
// Если указана ИнформационнаяБаза и в ней заполнен реквизит ПутьКПлатформе —
// используется этот путь. Иначе — автодетектирование.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы, Неопределено
//
// Возвращаемое значение:
//  Строка - полный путь к 1cv8.exe или пустая строка при неудаче
//
Функция ПутьКПлатформе(ИнформационнаяБаза = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ИнформационнаяБаза) Тогда

		Путь = цур_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ИнформационнаяБаза, "ПутьКПлатформе");

		Если НЕ ПустаяСтрока(Путь) Тогда
			Возврат Путь;
		КонецЕсли;

	КонецЕсли;

	// Fallback: автодетектирование по PATH
	ТекстОшибки = "";
	Возврат НайтиИсполняемыйФайлПлатформы(ТекстОшибки);

КонецФункции

// Определяет следующий номер версии расширения на основе значения реквизита ТекущаяВерсия
// базы сборки. Если реквизит пустой, возвращает 1, иначе — текущее число + 1.
//
// Возвращаемое значение:
//  Число - следующий номер версии
//
Функция ПолучитьСледующийНомерВерсии() Экспорт

	БазаСборки = НайтиБазуСборки();

	Если БазаСборки = Неопределено Тогда
		Возврат 1;
	КонецЕсли;

	ТекущаяВерсия = цур_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		БазаСборки.Ссылка, "ТекущаяВерсия");

	Если ПустаяСтрока("" + ТекущаяВерсия) Тогда
		Возврат 1;
	КонецЕсли;

	Если НЕ СтрДлина("" + ТекущаяВерсия) > 0 ИЛИ НЕ СтрЧислоВхождений("0123456789", Лев("" + ТекущаяВерсия, 1)) > 0 Тогда
		Возврат 1;
	КонецЕсли;

	Возврат Число(ТекущаяВерсия) + 1;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует новую структуру результата операции с начальными значениями.
Функция НовыйРезультатОперации()

	Результат = Новый Структура;
	Результат.Вставить("Успешно",     Ложь);
	Результат.Вставить("ПутьКCFE",   "");
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("Лог",         "");

	Возврат Результат;

КонецФункции

// Читает параметры подключения к базе сборки из констант.
// Если серверная база не настроена — определяет файловую базу из строки подключения или каталога расширения.
//
// Параметры:
//  КаталогРасширения - Строка - резервный путь если база не определена
//  РазделительПути   - Строка - разделитель пути на текущей ОС
//
// Возвращаемое значение:
//  Структура:
//   * СервернаяБаза - Булево
//   * ПутьКБазе     - Строка - для файловой базы
//   * Сервер        - Строка - для серверной базы
//   * ИмяБазы       - Строка - для серверной базы
//   * Пользователь  - Строка
//   * Пароль        - Строка
//
Функция ПолучитьПараметрыПодключения(КаталогРасширения, РазделительПути)

	Параметры = Новый Структура;
	Параметры.Вставить("СервернаяБаза", Ложь);
	Параметры.Вставить("ПутьКБазе",     "");
	Параметры.Вставить("Сервер",        "");
	Параметры.Вставить("ИмяБазы",       "");
	Параметры.Вставить("Пользователь",  "");
	Параметры.Вставить("Пароль",        "");

	БазаСборки = НайтиБазуСборки();

	Если БазаСборки = Неопределено Тогда
		ВызватьИсключение НСтр(
			"ru = 'Не настроена база сборки. Укажите информационную базу с флагом ""Использовать для сборки"" в справочнике ""Информационные базы"".'");
	КонецЕсли;

	ЗаполнитьПараметрыИзСправочника(Параметры, БазаСборки);

	Возврат Параметры;

КонецФункции

// Ищет в справочнике цур_ИнформационныеБазы запись с флагом ИспользоватьДляСборки.
//
// Возвращаемое значение:
//  Структура - реквизиты базы (СервернаяБаза, АдресБазы, Пользователь, Пароль, Ссылка)
//  Неопределено - если база сборки не найдена
//
Функция НайтиБазуСборки()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Базы.Ссылка КАК Ссылка,
	|	Базы.СервернаяБаза КАК СервернаяБаза,
	|	Базы.АдресБазы КАК АдресБазы,
	|	Базы.Пользователь КАК Пользователь,
	|	Базы.Пароль КАК Пароль
	|ИЗ
	|	Справочник.цур_ИнформационныеБазы КАК Базы
	|ГДЕ
	|	Базы.ИспользоватьДляСборки = ИСТИНА
	|	И НЕ Базы.ПометкаУдаления";

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Результат = Новый Структура;
	Результат.Вставить("Ссылка",        Выборка.Ссылка);
	Результат.Вставить("СервернаяБаза", Выборка.СервернаяБаза);
	Результат.Вставить("АдресБазы",     Выборка.АдресБазы);
	Результат.Вставить("Пользователь",  Выборка.Пользователь);
	Результат.Вставить("Пароль",        Выборка.Пароль);

	Возврат Результат;

КонецФункции

// Записывает новый (инкрементированный) номер версии в реквизит ТекущаяВерсия
// базы сборки справочника цур_ИнформационныеБазы.
//
Процедура ЗаписатьСледующийНомерВерсии()

	БазаСборки = НайтиБазуСборки();

	Если БазаСборки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НовыйНомер = ПолучитьСледующийНомерВерсии();

	ОбъектБазы = БазаСборки.Ссылка.ПолучитьОбъект();
	ОбъектБазы.ТекущаяВерсия = Формат(НовыйНомер, "ЧГ=0");
	ОбъектБазы.Записать();

КонецПроцедуры

// Заполняет параметры подключения из данных справочника.
Процедура ЗаполнитьПараметрыИзСправочника(Параметры, БазаСборки)

	Параметры.Пользователь = "" + БазаСборки.Пользователь;
	Параметры.Пароль       = "" + БазаСборки.Пароль;

	Если БазаСборки.СервернаяБаза Тогда

		Параметры.СервернаяБаза = Истина;
		АдресЧасти = СтрРазделить("" + БазаСборки.АдресБазы, "\");

		Если АдресЧасти.Количество() >= 2 Тогда
			Параметры.Сервер  = АдресЧасти[0];
			Параметры.ИмяБазы = АдресЧасти[1];
		Иначе
			Параметры.Сервер  = "" + БазаСборки.АдресБазы;
			Параметры.ИмяБазы = "";
		КонецЕсли;

	Иначе

		Параметры.ПутьКБазе = "" + БазаСборки.АдресБазы;

	КонецЕсли;

КонецПроцедуры

// Находит путь к исполняемому файлу платформы 1С.
// Сначала пробует КаталогПрограммы(), затем ищет в стандартном каталоге установки Windows.
//
// Параметры:
//  ТекстОшибки - Строка - заполняется при ошибке (передаётся по ссылке)
//
// Возвращаемое значение:
//  Строка - путь к исполняемому файлу
//
Функция НайтиИсполняемыйФайлПлатформы(ТекстОшибки)

	ИмяФайла = ?(ЭтоWindows(), "1cv8.exe", "1cv8");

	// Попытка 1: каталог текущего исполняемого приложения
	ПутьИзКаталогаПрограммы = КаталогПрограммы() + ИмяФайла;
	ФайлПлатформы = Новый Файл(ПутьИзКаталогаПрограммы);
	Если ФайлПлатформы.Существует() Тогда
		Возврат ПутьИзКаталогаПрограммы;
	КонецЕсли;

	// Попытка 2: стандартные каталоги установки
	Если ЭтоWindows() Тогда
		ПутьИзУстановки = НайтиФайлПлатформыВКаталогеУстановки(ИмяФайла);
	Иначе
		ПутьИзУстановки = НайтиФайлПлатформыВКаталогеУстановкиLinux(ИмяФайла);
	КонецЕсли;

	Если Не ПустаяСтрока(ПутьИзУстановки) Тогда
		Возврат ПутьИзУстановки;
	КонецЕсли;

	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекстОшибки = СтрШаблон(
		"Не найден исполняемый файл платформы 1С версии %1. Установите толстый клиент 1С:Предприятие.",
		СистемнаяИнформация.ВерсияПриложения);

	Возврат "";

КонецФункции

// Ищет исполняемый файл 1С в стандартном каталоге установки Windows (C:\Program Files\1cv8\).
// Выбирает подкаталог с максимальным именем версии.
//
// Параметры:
//  ИмяФайла - Строка - имя исполняемого файла (1cv8.exe)
//
// Возвращаемое значение:
//  Строка - полный путь к файлу или пустая строка если не найден
//
Функция НайтиФайлПлатформыВКаталогеУстановки(ИмяФайла)

	//BSLLS:UsingHardcodePath-off
	КореньУстановки = "C:\Program Files\1cv8\";
	//BSLLS:UsingHardcodePath-on

	ФайлКорня = Новый Файл(КореньУстановки);
	Если Не ФайлКорня.Существует() Тогда
		Возврат "";
	КонецЕсли;

	ПодкаталогиМассив = НайтиФайлы(КореньУстановки, "*", Ложь);

	// Подкаталоги имеют вид "8.3.NN.NNNN" - сравниваем числово по компонентам версии
	ПоследнийКаталог = "";
	ПоследняяВерсия  = "";

	Для Каждого Подкаталог Из ПодкаталогиМассив Цикл

		Если Не Подкаталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;

		Если СравнитьВерсии(Подкаталог.Имя, ПоследняяВерсия) > 0 Тогда
			ПоследняяВерсия  = Подкаталог.Имя;
			ПоследнийКаталог = Подкаталог.ПолноеИмя;
		КонецЕсли;

	КонецЦикла;

	Если ПустаяСтрока(ПоследнийКаталог) Тогда
		Возврат "";
	КонецЕсли;

	ПутьКФайлу = ПоследнийКаталог + "\bin\" + ИмяФайла;
	ФайлПроверки = Новый Файл(ПутьКФайлу);
	Если ФайлПроверки.Существует() Тогда
		Возврат ПутьКФайлу;
	КонецЕсли;

	Возврат "";

КонецФункции

// Ищет исполняемый файл 1С в стандартных каталогах установки Linux.
// Проверяет /opt/1cv8/ и /opt/1C/v8.3/ — выбирает максимальную версию.
//
// Параметры:
//  ИмяФайла - Строка - имя исполняемого файла (1cv8)
//
// Возвращаемое значение:
//  Строка - путь к файлу или пустая строка
//
Функция НайтиФайлПлатформыВКаталогеУстановкиLinux(ИмяФайла)

	КаталогиПоиска = Новый Массив;
	КаталогиПоиска.Добавить("/opt/1cv8/");
	КаталогиПоиска.Добавить("/opt/1C/v8.3/");

	Для Каждого Каталог Из КаталогиПоиска Цикл

		ФайлКаталога = Новый Файл(Каталог);

		Если НЕ ФайлКаталога.Существует() Тогда
			Продолжить;
		КонецЕсли;

		МаксимальнаяВерсия = "";
		ПутьМаксимальной  = "";

		НайденныеКаталоги = НайтиФайлы(Каталог, "*", Ложь);

		Для Каждого ПодКаталог Из НайденныеКаталоги Цикл

			Если НЕ ПодКаталог.ЭтоКаталог() Тогда
				Продолжить;
			КонецЕсли;

			ПутьКандидат = ПодКаталог.ПолноеИмя + "/" + ИмяФайла;
			ФайлКандидат = Новый Файл(ПутьКандидат);

			Если ФайлКандидат.Существует() И СравнитьВерсии(ПодКаталог.Имя, МаксимальнаяВерсия) > 0 Тогда
				МаксимальнаяВерсия = ПодКаталог.Имя;
				ПутьМаксимальной  = ПутьКандидат;
			КонецЕсли;

		КонецЦикла;

		Если НЕ ПустаяСтрока(ПутьМаксимальной) Тогда
			Возврат ПутьМаксимальной;
		КонецЕсли;

	КонецЦикла;

	Возврат "";

КонецФункции

// Формирует командную строку для загрузки XML-исходников расширения в базу (LoadConfigFromFiles).
//
// Параметры:
//  ПутьИсполняемогоФайла - Строка
//  ПараметрыПодключения  - Структура - см. ПолучитьПараметрыПодключения()
//  КаталогРасширения     - Строка
//  ИмяРасширения         - Строка
//  ФайлЛога              - Строка - путь к файлу вывода лога
//
// Возвращаемое значение:
//  Строка - готовая командная строка
//
Функция СформироватьКомандуЗагрузки(ПутьИсполняемогоФайла, ПараметрыПодключения, КаталогРасширения, ИмяРасширения, ФайлЛога)

	ЧастиКоманды = Новый Массив;
	ЧастиКоманды.Добавить(СтрШаблон("""%1""", ПутьИсполняемогоФайла));
	ЧастиКоманды.Добавить(СформироватьПараметрПодключения(ПараметрыПодключения));
	ДобавитьУчетныеДанные(ЧастиКоманды, ПараметрыПодключения);
	ЧастиКоманды.Добавить("/LoadConfigFromFiles");
	ЧастиКоманды.Добавить(СтрШаблон("""%1""", КаталогРасширения));
	ЧастиКоманды.Добавить("-Extension");
	ЧастиКоманды.Добавить(ИмяРасширения);
	ЧастиКоманды.Добавить("/UpdateDBCfg");
	ЧастиКоманды.Добавить("/DisableStartupMessages");
	ЧастиКоманды.Добавить("/DisableStartupDialogs");
	ЧастиКоманды.Добавить(СтрШаблон("/Out ""%1""", ФайлЛога));

	Возврат СтрСоединить(ЧастиКоманды, " ");

КонецФункции

// Формирует командную строку для выгрузки CFE из базы (DumpCfg).
//
// Параметры:
//  ПутьИсполняемогоФайла - Строка
//  ПараметрыПодключения  - Структура - см. ПолучитьПараметрыПодключения()
//  ПутьCFE               - Строка - путь к создаваемому файлу CFE
//  ИмяРасширения         - Строка
//  ФайлЛога              - Строка - путь к файлу вывода лога
//
// Возвращаемое значение:
//  Строка - готовая командная строка
//
Функция СформироватьКомандуВыгрузки(ПутьИсполняемогоФайла, ПараметрыПодключения, ПутьCFE, ИмяРасширения, ФайлЛога)

	ЧастиКоманды = Новый Массив;
	ЧастиКоманды.Добавить(СтрШаблон("""%1""", ПутьИсполняемогоФайла));
	ЧастиКоманды.Добавить(СформироватьПараметрПодключения(ПараметрыПодключения));
	ДобавитьУчетныеДанные(ЧастиКоманды, ПараметрыПодключения);
	ЧастиКоманды.Добавить("/DumpCfg");
	ЧастиКоманды.Добавить(СтрШаблон("""%1""", ПутьCFE));
	ЧастиКоманды.Добавить("-Extension");
	ЧастиКоманды.Добавить(ИмяРасширения);
	ЧастиКоманды.Добавить("/DisableStartupMessages");
	ЧастиКоманды.Добавить("/DisableStartupDialogs");
	ЧастиКоманды.Добавить(СтрШаблон("/Out ""%1""", ФайлЛога));

	Возврат СтрСоединить(ЧастиКоманды, " ");

КонецФункции

// Формирует фрагмент командной строки с параметром подключения к базе.
// Для файловой базы: designer /F "путь"
// Для серверной базы: designer /S "сервер\имя_базы"
//
// Параметры:
//  ПараметрыПодключения - Структура - см. ПолучитьПараметрыПодключения()
//
// Возвращаемое значение:
//  Строка
//
Функция СформироватьПараметрПодключения(ПараметрыПодключения)

	Если ПараметрыПодключения.СервернаяБаза Тогда
		АдресБазы = ПараметрыПодключения.Сервер + "\" + ПараметрыПодключения.ИмяБазы;
		Возврат СтрШаблон("designer /S ""%1""", АдресБазы);
	КонецЕсли;

	Возврат СтрШаблон("designer /F ""%1""", ПараметрыПодключения.ПутьКБазе);

КонецФункции

// Добавляет в массив частей команды параметры пользователя и пароля, если они заполнены.
//
// Параметры:
//  ЧастиКоманды         - Массив - массив строк команды (изменяется)
//  ПараметрыПодключения - Структура - см. ПолучитьПараметрыПодключения()
//
Процедура ДобавитьУчетныеДанные(ЧастиКоманды, ПараметрыПодключения)

	Если ЗначениеЗаполнено(ПараметрыПодключения.Пользователь) Тогда
		ЧастиКоманды.Добавить(СтрШаблон("/N ""%1""", ПараметрыПодключения.Пользователь));
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
		ЧастиКоманды.Добавить(СтрШаблон("/P ""%1""", ПараметрыПодключения.Пароль));
	КонецЕсли;

КонецПроцедуры

// Читает текст лога из файла. Возвращает пустую строку если файл не существует.
//
// Параметры:
//  ПутьКФайлу - Строка
//
// Возвращаемое значение:
//  Строка
//
Функция ПрочитатьФайлЛога(ПутьКФайлу)

	ПроверкаФайла = Новый Файл(ПутьКФайлу);
	Если Не ПроверкаФайла.Существует() Тогда
		Возврат "";
	КонецЕсли;

	ЧтениеФайла = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ТекстЛога   = ЧтениеФайла.Прочитать();
	ЧтениеФайла.Закрыть();

	Возврат ТекстЛога;

КонецФункции

// Определяет, работает ли сервер на платформе Windows.
//
// Возвращаемое значение:
//  Булево
//
// Проверяет, имеет ли текущий пользователь право на установку расширений.
// Доступ есть у администраторов и пользователей с ролью цур_РаботаСГенераторомРолей.
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьПравоУстановкиРасширений()

	Если ПривилегированныйРежим() Тогда
		Возврат Истина;
	КонецЕсли;

	Если цур_ОбщегоНазначения.ЕстьРоль("цур_РаботаСГенераторомРолей") Тогда
		Возврат Истина;
	КонецЕсли;

	Если цур_ОбщегоНазначения.ЕстьРоль("АдминистраторСистемы") Тогда
		Возврат Истина;
	КонецЕсли;

	Если цур_ОбщегоНазначения.ЕстьРоль("ПолныеПрава") Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция ЭтоWindows()

	Возврат цур_ОбщегоНазначения.ЭтоWindowsСервер();

КонецФункции

// Сравнивает две строки версий вида "8.3.23.1997" как наборы чисел.
//
// Параметры:
//  Версия1 - Строка - первая строка версии
//  Версия2 - Строка - вторая строка версии
//
// Возвращаемое значение:
//  Число - 1 если Версия1 > Версия2, -1 если меньше, 0 если равны
//
Функция СравнитьВерсии(Версия1, Версия2)

	Части1 = СтрРазделить(Версия1, ".");
	Части2 = СтрРазделить(Версия2, ".");

	МаксКоличество = Макс(Части1.Количество(), Части2.Количество());

	Для Индекс = 0 По МаксКоличество - 1 Цикл

		Число1 = ?(Индекс < Части1.Количество(), Число(СокрЛП(Части1[Индекс])), 0);
		Число2 = ?(Индекс < Части2.Количество(), Число(СокрЛП(Части2[Индекс])), 0);

		Если Число1 > Число2 Тогда
			Возврат 1;
		ИначеЕсли Число1 < Число2 Тогда
			Возврат -1;
		КонецЕсли;

	КонецЦикла;

	Возврат 0;

КонецФункции

#КонецОбласти

#КонецЕсли
